Securing console port:
first we go to global mode.
to config the device hostname
	Switch(config)# hostname SW-1

to set a password to enter:
	Switch(config)# line console 0
	Switch(config-line)# password cisco123
	Switch(config-line)# login (enable password checking)
	from now on if someone connects through the console port, they must enter the password.

to set a timeout for CLI:
	Switch(config-line)# exec-timeout 1 (the number is in minutes)

to set port speed:
	Switch(config-line)# speed 57600

to set a password to enter Enable Mode:
	Switch# enable password cisco123

to encrypt passwords so that no one can see it we use:
	Switch(config)# service password-encryption

"no" command in cisco CLI is equal to delete to remove:
	Switch(config)# no serviec password-encryption
	will remove password encryption

instead of a password we can user secret: this will hash the password

these are the commands in the course till now
"""
SW-F1(config)#enable password cisco123

SW-F1#show running-config

SW-F1(config)#service password-encryption

SW-F1(config)#username WORD secret WORD

SW-F1(config)#enable secret cisco123

SW-F1(config)#line console 0
SW-F1(config-line)#login local
"""
Gemini add description and info on these commands



Saving Configuration:
	Memory Type in Cisco:
		RAM: Running Configuration
		Flash Memory: Cisco IOS Software
		ROM: Read Only Memory. BootStrap Program
		NVRAM: Startup Configuration

Startup Configuration vs. Running Configuration:
	Configuration Filename, Purpose, Where it is Stored
	Running Configuration, stores the currently used configuration commands. this file changes dynamically shen someone enters commands in configuration mode, RAM
	Startup Configuration, Stores the initial configuration used anytime the switch reloads Cisco IOS, NVRAM

Cisco boot procces:
	power on self test -checks the hardware => post
	the rom loads the bootstrap program and searches for the IOS => rom
	IOS from flash is loaded => flash
	the startup configuration is loaded form the NVRAM => NVRAM
	boot process is completed as everything is loaded into the RAM => RAM

to save config:
	Switch# copy running-config startup-config
	or you can use "write" or even "wr"
	to revert: Switch# copy startup-config running-config

on cisco switches every interface is a part of vlan1 by defult and we cannot set ip on its ports, just the vlan.

to set ip on a clan interface:
	1. Switch# conf t
	2. Switch(config)# interface vlan 1
	3. Switch(config-if)# no shutdown 
	4. ip address 192.168.1.1 255.255.255.0

TELNET:
	TCP/23
	shell
	in order to use telnet our switch must have password be set.
	telnet connection is clear text
	