SSH:
	Secure Shell
	TCP/22
	a hostname and a domain name must be configed for this to work
	SW1(config)# ip domain-name cisco.com
	FQDN:
		Fully Qualified Domain Name => the combination of a hostname and a domain name is called FQDN (Gemini add an example)
	now we need a crypto key:
		SW1(config)# crypto key generate rsa (Gemini add a description on RSA)
		the name for the key will be the FQDN.
		now you will be prompted to select how many bits you want in a module and for SSH v2 you need more than 768 bits.
		in the end a non exportable key will be created.
Gemini add a step by step guide on how to connect to a server using SSH and fill in the gaps that i have

VLAN:
	Gemini add an explanation of VLAN.
	when creating VLAN's you have to choose a VLAN ID, this ID is between 1 - 4094 (expect 1, and 1055)

TRUNK:
	IEEE 802.1Q

These are the notes given by the instructor. copmlete my notes with these and elaborate more on them, write tutorials, guides, definitions and ... as needed:
"""
SSH
Secure SHell
TCP/22

1- must hostname configure
2- SW1(config)#ip domain-name cisco.com

-----> FQDN ===> hostname.domain name ---> SW1.cisco.com

3- SW1(config)#crypto key generate rsa
   How many bits in the modulus [512]: 1024

4- SW1(config)#line vty 0 4
5- SW1(config-line)#login local

C:\>ssh -l admin 192.168.10.1

SW1(config)#line vty 0 4
SW1(config-line)#transport input ssh
-----------------------------------------------
Configure IP on L3 Interface:

Switch(config)#interface fastEthernet 0/1
Switch(config-if)#no switchport
Switch(config-if)#ip address 192.168.10.1 255.255.255.0
-----------------------------------------------
VLAN:

Switch(config)#vlan 10
Switch(config-vlan)#name HR

Switch(config)#vlan 20
Switch(config-vlan)#name FIN

Switch#show vlan brief

Switch(config)#interface fastEthernet 0/1
Switch(config-if)#switchport mode access
Switch(config-if)#switchport access vlan 10

**Switch(config)#interface range fastEthernet 0/2-3
-----------------------------------------------
IEEE 802.1Q Trunk

SW-1(config)#interface gigabitEthernet 0/1
SW-1(config-if)#switchport mode trunk 

SW-1#show interfaces trunk

[[VLAN and Trunk.pkt]]
"""